// Задача 29: Напишите программу, которая приниматет на вход длину массива, 
// минимальное значение массива и максимальное значение массива, создаёт массив с 
// заданными параметрами и выводит значения на экран
// 5, 1, 19 -> [1, 2, 5, 7, 19]
// 3, 1, 33 -> [6, 1, 33]

Console.Clear();

Console.Write("Введите Длинну массива: ");
int[] array = int.Parse(Console.ReadLine()!);

